Бухгалтерия_обновление_тест1/src/ChartsOfCharacteristicTypes/СтатьиРасходов/СтатьиРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СтатьиРасходов</name>
  <type>
    <types>CatalogRef.ОбъектыЭксплуатации</types>
    <types>CatalogRef.МаркетинговыеМероприятия</types>
    <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СтатьиКалькуляции</types>
    <types>DocumentRef.ЗаказПоставщику</types>
    <types>CatalogRef.НематериальныеАктивы</types>
    <types>DocumentRef.ВводОстатковДенежныхСредств</types>
    <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
    <types>DocumentRef.ВводОстатков</types>
    <types>EnumRef.АналитикаКурсовыхРазниц</types>
    <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</types>
    <types>CatalogRef.ОбъектыСтроительства</types>
    <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
    <types>DocumentRef.ПеремещениеТоваров</types>
    <types>DocumentRef.ЗаказНаСборку</types>
    <types>CatalogRef.ПретензииКлиентов</types>
    <types>DocumentRef.РеализацияТоваровУслуг</types>
    <types>EnumRef.ВидыОперацийПоЗарплате</types>
    <types>CatalogRef.Партнеры</types>
    <types>DocumentRef.КорректировкаПриобретения</types>
    <types>CatalogRef.ПрочиеАктивыПассивы</types>
    <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
    <types>DocumentRef.АктВыполненныхРабот</types>
    <types>DocumentRef.ЗаказНаПеремещение</types>
    <types>DocumentRef.ВводОстатковПоФинансовымИнструментам</types>
    <types>DocumentRef.СборкаТоваров</types>
    <types>CatalogRef.СделкиСКлиентами</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.Кассы</types>
    <types>DocumentRef.ВводОстатковТоваров</types>
    <types>DocumentRef.ВводОстатковПрочиеРасходы</types>
    <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>DocumentRef.ЗаказКлиента</types>
    <types>CatalogRef.Проекты</types>
    <types>EnumRef.ВидыОбязательногоСтрахованияСотрудников</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ПрочиеРасходы</types>
    <types>DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</types>
    <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
    <types>DocumentRef.ВводОстатковРасчетовПоЭквайрингу</types>
    <types>DocumentRef.ВводОстатковСПодотчетниками</types>
    <types>DocumentRef.ВводОстатковПрочихАктивовПассивов</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АмортизацияВременнойРазницы2020</name>
      <description>Амортизация временной разницы, возникшей по результатам инвентаризации ОФ в 2020 г.</description>
      <code>000000016</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ВыбытияТоваровВПрошлыхПериодах</name>
      <description>Выбытия товаров в прошлых периодах</description>
      <code>000000012</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>ЗатратыПриПокупкеИПродажеИностраннойВалюты</name>
      <description>Затраты при покупке и продаже иностранной валюты</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>КурсовыеРазницыНеоперационные</name>
      <description>Курсовые разницы (неоперационная деятельность)</description>
      <code>000000009</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>КурсовыеРазницы</name>
      <description>Курсовые разницы (операционная деятельность)</description>
      <code>000000003</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>НачисленныйНДСПриВыкупеМногооборотнойТары</name>
      <description>Начисленный НДС при выкупе многооборотной тары</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.МаркетинговыеМероприятия</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СтатьиКалькуляции</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>CatalogRef.ПретензииКлиентов</types>
        <types>CatalogRef.Партнеры</types>
        <types>DocumentRef.ЗаказНаПеремещение</types>
        <types>CatalogRef.СделкиСКлиентами</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.ПрочиеРасходы</types>
      </type>
    </items>
    <items>
      <name>ПогрешностьРасчетаСебестоимости</name>
      <description>Погрешность расчета себестоимости</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.МаркетинговыеМероприятия</types>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.СделкиСКлиентами</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.ПрочиеРасходы</types>
      </type>
    </items>
    <items>
      <name>ПрибыльУбытокПрошлыхЛет</name>
      <description>Прибыль (убыток) прошлых периодов</description>
      <code>000000015</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>РазницыСтоимостиВозвратаИФактическойСтоимостиТоваров</name>
      <description>Разницы стоимости возврата и фактической стоимости товаров</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
    <items>
      <name>РаспределениеНачальныхОстатковНЗП</name>
      <description>Распределение начальных остатков НЗП</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.ПрочиеРасходы</types>
      </type>
    </items>
    <items>
      <name>РасходыПриКонвертацииВалюты</name>
      <description>Расходы при конвертации валюты</description>
      <code>000000014</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>РасходыПриПерерасчетеПропорциональногоНДС</name>
      <description>Расходы при перерасчете пропорционального НДС</description>
      <code>000000010</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>СебестоимостьПродаж</name>
      <description>Себестоимость продаж</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.МаркетинговыеМероприятия</types>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>CatalogRef.СделкиСКлиентами</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>ФормированиеРезервовПоСомнительнымДолгам</name>
      <description>Формирование резервов по сомнительным долгам</description>
      <code>000000008</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>АналитикаРасходовЗаказРеализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределенияРасходовРегл</name>
    <type>
      <types>EnumRef.ВариантыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределенияРасходовУпр</name>
    <type>
      <types>EnumRef.ВариантыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиРасходов</name>
    <type>
      <types>EnumRef.ВидыДеятельностиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенности</name>
    <type>
      <types>EnumRef.ВидыЦенностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКредитовИДепозитов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЗаполнениеАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьИспользование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияНаСебестоимость</name>
    <type>
      <types>EnumRef.ПравилаРаспределенияНаСебестоимостьТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПравилоРаспределенияПоПодразделениям</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПравилоРаспределенияПоЭтапамПроизводства</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыНаНМАиНИОКР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыНаОбъектыСтроительства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыНаОбъектыЭксплуатации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособРаспределенияНаПроизводственныеЗатраты</name>
    <type>
      <types>EnumRef.СпособыРаспределенияСтатейРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособРаспределенияПоНаправлениямДеятельности</name>
    <type>
      <types>CatalogRef.СпособыРаспределенияПоНаправлениямДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасходов</name>
    <type>
      <types>EnumRef.ТипыРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерПроизводственныхЗатрат</name>
    <type>
      <types>EnumRef.ХарактерПроизводственныхЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПравилоРаспределенияРасходов</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыНаЗаказыНаРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияРасходовУпр</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияРасходовРегл</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыНаРемонтОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета8Класс</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьРеализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

Бухгалтерия_обновление_тест1/src/CommonModules/ВыкупВозвратнойТарыУПоставщикаЛокализация/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	//++ НЕ УТ
	МеханизмыДокумента.Добавить("РегламентированныйУчет");
	//-- НЕ УТ
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект.<Имя документа> - Исходный документ, который является источником копирования.
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт


КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ
#Область ПроводкиРегУчета

// Функция возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчете() Экспорт
	
	//++ Локализация
	Возврат ТекстОтраженияВРеглУчетеУКР(); 
	//-- Локализация
	Возврат "";
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц,
// необходимых для отражения в регламентированном учете
//
// Возвращаемое значение:
//   Строка - сформированный текст запроса.
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	//++ Локализация
	Возврат ТекстЗапросаВТОтраженияВРеглУчетеУКР();
	//-- Локализация
	Возврат "";
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

//++ НЕ УТ
#Область ПроводкиРегУчетаУКР

// Функция возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчетеУКР() Экспорт
	
	//++ Локализация

	ЯзыкСодержания = МультиязычностьУкр.КодЯзыкаИнформационнойБазы();
 

	ТекстыОтражения = Новый Массив;

#Область ВключениеИсключениеНДСВСтоимость


	ТекстЗапроса = "
	|ВЫБРАТЬ ////  Условная продажа при использовании облагаемого товара в необлагаемых операциях  (Дт 90 :: Кт 6435)
	|        ////  Сторно условной продажи при использовании облагаемого товара в необлагаемых операциях  (Дт 90 :: Кт 6435 сторно)
	|	Операция.Ссылка КАК Ссылка,
	|	Партии.Период КАК Период,
	|	Партии.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР КОГДА Партии.ВключениеНДСВСтоимость ТОГДА
	|		Партии.НДСРегл
	|	ИНАЧЕ
	|		-Партии.НДСРегл
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР КОГДА Партии.ВключениеНДСВСтоимость ТОГДА
	|		Партии.НДСУпр
	|	ИНАЧЕ
	|		-Партии.НДСУпр
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НачисленныйНДСПриВыкупеМногооборотнойТары) КАК АналитикаУчетаДт,
	|	Партии.Склад КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.Подразделение КАК ПодразделениеДт,
	|	Партии.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|
	|	Партии.ГруппаФинансовогоУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	Партии.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УсловнаяПродажа) КАК СчетКт,
	|
	|	Партии.Контрагент КАК СубконтоКт1,
	|	Партии.ДокументПоступления КАК СубконтоКт2,
	|	Операция.Ссылка КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
 	|	ВЫБОР КОГДА Партии.ВключениеНДСВСтоимость ТОГДА
	|		""%1""
	|	ИНАЧЕ
	|		""%2""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВыкупВозвратнойТарыУПоставщика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Партии КАК Партии
	|	ПО
	|		Операция.Ссылка = Партии.Ссылка
	|	
	|ГДЕ
	|	(Партии.ВключениеНДСВСтоимость ИЛИ Партии.ИсключениеНДСИзСтоимости)
	|";
	
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, 
		НСтр("ru='Условная продажа';uk='Умовний продаж'",ЯзыкСодержания),НСтр("ru='Сторно условной продажи';uk='Сторно умовного продажу'",ЯзыкСодержания));

	ТекстыОтражения.Добавить(ТекстЗапроса);
	
#КонецОбласти


#Область ТараНДСОжидаемый

	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	СУММА(ЕСТЬNULL(Суммы.СуммаНДСРегл, Строки.СуммаНДС)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(Суммы.СуммаНДСУпрМУ, Строки.СуммаНДС)) КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.Номенклатура.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный) КАК СчетДт,
	|
	|	Операция.Контрагент КАК СубконтоДт1,
	|	Операция.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщикамиТара) КАК ВидСчетаКт,
	|	ЕСТЬNULL(Расчеты.ГруппаФинансовогоУчета, Операция.ГруппаФинансовогоУчета) КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЕСТЬNULL(Расчеты.Подразделение, Операция.Подразделение) КАК ПодразделениеКт,
	|	ЕСТЬNULL(Расчеты.НаправлениеДеятельности, Операция.НаправлениеДеятельности) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Операция.Контрагент КАК СубконтоКт1,
	|	Операция.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	СУММА(Строки.СуммаВзаиморасчетов - Строки.СуммаНДСВзаиморасчетов) КАК ВалютнаяСуммаКт,
	|	0 КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""%1"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВыкупВозвратнойТарыУПоставщика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.ВыкупВозвратнойТарыУПоставщика.Товары КАК Строки
	|	ПО 
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СуммыДокументовВВалютахУчета КАК Суммы
	|	ПО 
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТРасчетыСПоставщиками КАК Расчеты
	|	ПО 
	|		Расчеты.Ссылка = Операция.Ссылка
	|		
	|ГДЕ
	|	Операция.ВозвратТарыНеПросрочен
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Строки.Номенклатура.ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(Расчеты.ГруппаФинансовогоУчета, Операция.ГруппаФинансовогоУчета),
	|	ЕСТЬNULL(Расчеты.Подразделение, Операция.Подразделение),
	|	ЕСТЬNULL(Расчеты.НаправлениеДеятельности, Операция.НаправлениеДеятельности)
	|";

	ТекстЗапроса = СтрШаблон(ТекстЗапроса, 
		НСтр("ru='НДС: налоговый кредит не подтвержденный';uk='ПДВ: податковий кредит, не підтверджений'",ЯзыкСодержания));
 	
	ТекстыОтражения.Добавить(ТекстЗапроса);
	
#КонецОбласти

	Возврат СтрСоединить(ТекстыОтражения, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	//-- Локализация
	Возврат "";
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц,
// необходимых для отражения в регламентированном учете
//
// Возвращаемое значение:
//   Строка - сформированный текст запроса.
//
Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат "";
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация
	//++ НЕ УТ
	РеглУчетПроведениеСервер.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(Запрос, ТекстыЗапроса, Регистры);
	//-- НЕ УТ
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
